In [165]:
import pandas as pd
import numpy as np

In [166]:
data = pd.read_csv('C:\\Users\\aman yadav\\OneDrive\\Desktop\\SE Project\\Bengaluru_House_Data.csv')

In [167]:
data.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00

In [168]:
data.shape

(13320, 9)

In [171]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   area_type     13320 non-null  object
 1   availability  13320 non-null  object
 2   location      13319 non-null  object
 3   size          13304 non-null  object
 4   society       7818 non-null   object
 5   total_sqft    13320 non-null  object
 6   bath          13247 non-null  float64
 7   balcony       12711 non-null  float64
 8   price         13320 non-null  float64
dtypes: float64(3), object(6)
memory usage: 936.7+ KB

In [172]:
for column in data.columns:
    print(data[column].value_counts())
    print("*"*20)

Super built-up  Area    8790
Built-up  Area          2418
Plot  Area              2025
Carpet  Area              87
Name: area_type, dtype: int64
********************
Ready To Move    10581
18-Dec             307
18-May             295
18-Apr             271
18-Aug             200
                 ...
16-Nov               1
14-Nov               1
16-Jul               1
15-Aug               1
16-Oct               1
Name: availability, Length: 81, dtype: int64
********************
Whitefield            540
Sarjapur  Road        399
Electronic City       302
Kanakpura Road        273
Thanisandra           234
                     ...
Manonarayanapalya       1
Vijay Nagar             1
Prakruthi Township      1
Shakthi Nagar           1
Bank Avenue             1
Name: location, Length: 1305, dtype: int64
********************
2 BHK         5199
3 BHK         4310
4 Bedroom      826
4 BHK          591
3 Bedroom      547
1 BHK          538
2 Bedroom      329
5 Bedroom      297
6 Bedroom      191
1 Bedroom      105
8 Bedroom       84
7 Bedroom       83
5 BHK           59
9 Bedroom       46
6 BHK           30
7 BHK           17
1 RK            13
10 Bedroom      12
9 BHK            8
8 BHK            5
11 BHK           2
11 Bedroom       2
10 BHK           2
13 BHK           1
19 BHK           1
27 BHK           1
12 Bedroom       1
14 BHK           1
18 Bedroom       1
43 Bedroom       1
16 BHK           1
Name: size, dtype: int64
********************
GrrvaGr    80
PrarePa    76
Sryalan    59
Prtates    59
GMown E    56
           ..
Frhtsr      1
MNlam G     1
Saaveha     1
CaIRSCr     1
Caiya D     1
Name: society, Length: 2688, dtype: int64
********************
1200           843
1100           221
1500           205
2400           196
600            180
              ...
1316             1
2150 - 2225      1
1922             1
3056             1
2496             1
Name: total_sqft, Length: 2117, dtype: int64
********************
2.0     6908
3.0     3286
4.0     1226
1.0      788
5.0      524
6.0      273
7.0      102
8.0       64
9.0       43
10.0      13
12.0       7
13.0       3
11.0       3
16.0       2
27.0       1
18.0       1
40.0       1
15.0       1
14.0       1
Name: bath, dtype: int64
********************
2.0    5113
1.0    4897
3.0    1672
0.0    1029
Name: balcony, dtype: int64
********************
75.00    310
65.00    302
55.00    275
60.00    270
45.00    240
        ...
81.55      1
69.49      1
42.18      1
70.25      1
74.82      1
Name: price, Length: 1994, dtype: int64
********************

In [173]:
data.isna().sum()

area_type          0
availability       0
location           1
size              16
society         5502
total_sqft         0
bath              73
balcony          609
price              0
dtype: int64

In [174]:
data.drop(columns = ['society'],inplace = True)

In [175]:
data.describe()

               bath       balcony         price
count  13247.000000  12711.000000  13320.000000
mean       2.692610      1.584376    112.565627
std        1.341458      0.817263    148.971674
min        1.000000      0.000000      8.000000
25%        2.000000      1.000000     50.000000
50%        2.000000      2.000000     72.000000
75%        3.000000      2.000000    120.000000
max       40.000000      3.000000   3600.000000

In [176]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 8 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   area_type     13320 non-null  object
 1   availability  13320 non-null  object
 2   location      13319 non-null  object
 3   size          13304 non-null  object
 4   total_sqft    13320 non-null  object
 5   bath          13247 non-null  float64
 6   balcony       12711 non-null  float64
 7   price         13320 non-null  float64
dtypes: float64(3), object(5)
memory usage: 832.6+ KB

In [177]:
data['location'].value_counts()

Whitefield            540
Sarjapur  Road        399
Electronic City       302
Kanakpura Road        273
Thanisandra           234
                     ...
Manonarayanapalya       1
Vijay Nagar             1
Prakruthi Township      1
Shakthi Nagar           1
Bank Avenue             1
Name: location, Length: 1305, dtype: int64

In [178]:
data['availability'].value_counts()

Ready To Move    10581
18-Dec             307
18-May             295
18-Apr             271
18-Aug             200
                 ...
16-Nov               1
14-Nov               1
16-Jul               1
15-Aug               1
16-Oct               1
Name: availability, Length: 81, dtype: int64

In [179]:
data['location'] = data['location'].fillna('Sarjapur Road')

In [180]:
data['size'].value_counts()

2 BHK         5199
3 BHK         4310
4 Bedroom      826
4 BHK          591
3 Bedroom      547
1 BHK          538
2 Bedroom      329
5 Bedroom      297
6 Bedroom      191
1 Bedroom      105
8 Bedroom       84
7 Bedroom       83
5 BHK           59
9 Bedroom       46
6 BHK           30
7 BHK           17
1 RK            13
10 Bedroom      12
9 BHK            8
8 BHK            5
11 BHK           2
11 Bedroom       2
10 BHK           2
13 BHK           1
19 BHK           1
27 BHK           1
12 Bedroom       1
14 BHK           1
18 Bedroom       1
43 Bedroom       1
16 BHK           1
Name: size, dtype: int64

In [181]:
data['size'] = data['size'].fillna('2 BHK')

In [182]:
data['bath'] = data['bath'].fillna(data['bath'].median())

In [183]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 8 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   area_type     13320 non-null  object
 1   availability  13320 non-null  object
 2   location      13320 non-null  object
 3   size          13320 non-null  object
 4   total_sqft    13320 non-null  object
 5   bath          13320 non-null  float64
 6   balcony       12711 non-null  float64
 7   price         13320 non-null  float64
dtypes: float64(3), object(5)
memory usage: 832.6+ KB

In [184]:
data['bhk'] = data['size'].str.split().str.get(0).astype(int)

In [185]:
data[data.bhk>20]

,area_type,availability,location,size,total_sqft,bath,balcony,price,bhk
1718,Super built-up Area,Ready To Move,2Electronic City Phase II,27 BHK,8000,27.0,0.0,230.0,27
4684,Plot Area,Ready To Move,Munnekollal,43 Bedroom,2400,40.0,0.0,660.0,43

In [186]:
data['total_sqft'].unique()

array(['1056', '2600', '1440', ..., '1133 - 1384', '774', '4689'],
      dtype=object)

In [187]:
def convertRange(x):
    temp = x.split('-')
    if len(temp) == 2:
        return (float(temp[0]) + float(temp[1]))/2
    try:
        return float(x)
    except:
        return None

In [188]:
data['total_sqft'] = data['total_sqft'].apply(convertRange)

In [189]:
data.head()

,area_type,availability,location,size,total_sqft,bath,balcony,price,bhk
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,1056.0,2.0,1.0,39.07,2
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,2600.0,5.0,3.0,120.00,4
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,1440.0,2.0,3.0,62.00,3
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,1521.0,3.0,1.0,95.00,3
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,1200.0,2.0,1.0,51.00,2

In [190]:
# Price Per Square Feet

In [191]:
data['price_per_sqft'] = data['price']*100000/data['total_sqft']

In [192]:
data['price_per_sqft']

0         3699.810606
1         4615.384615
2         4305.555556
3         6245.890861
4         4250.000000
             ...
13315     6689.834926
13316    11111.111111
13317     5258.545136
13318    10407.336319
13319     3090.909091
Name: price_per_sqft, Length: 13320, dtype: float64

In [193]:
data.describe()

,total_sqft,bath,balcony,price,bhk,price_per_sqft
count,13274.000000,13320.000000,12711.000000,13320.000000,13320.000000,1.327400e+04
mean,1559.626694,2.688814,1.584376,112.565627,2.802778,7.907501e+03
std,1238.405258,1.338754,0.817263,148.971674,1.294496,1.064296e+05
min,1.000000,1.000000,0.000000,8.000000,1.000000,2.678298e+02
25%,1100.000000,2.000000,1.000000,50.000000,2.000000,4.266865e+03
50%,1276.000000,2.000000,2.000000,72.000000,3.000000,5.434306e+03
75%,1680.000000,3.000000,2.000000,120.000000,3.000000,7.311746e+03
max,52272.000000,40.000000,3.000000,3600.000000,43.000000,1.200000e+07

In [194]:
data['location'].value_counts()

Whitefield            540
Sarjapur  Road        399
Electronic City       302
Kanakpura Road        273
Thanisandra           234
                     ...
Manonarayanapalya       1
Vijay Nagar             1
Prakruthi Township      1
Shakthi Nagar           1
Bank Avenue             1
Name: location, Length: 1306, dtype: int64

In [195]:
data['location'] = data['location'].apply(lambda x:x.strip())
location_count = data['location'].value_counts()

In [196]:
location_count_less_10 = location_count[location_count<=10]
location_count_less_10

Dairy Circle                           10
1st Block Koramangala                  10
BTM 1st Stage                          10
Kalkere                                10
Ganga Nagar                            10
                                       ..
Queens Road                             1
5 Bedroom Farm House in Lakshmipura     1
Xavier Layout                           1
ITI Employees Layout                    1
Bank Avenue                             1
Name: location, Length: 1054, dtype: int64

In [197]:
data['location'] = data['location'].apply(lambda x: 'other' if x in location_count_less_10 else x)

In [198]:
data['location'].value_counts()

other                        2886
Whitefield                    541
Sarjapur  Road                399
Electronic City               304
Kanakpura Road                273
                             ...
Nehru Nagar                    11
Tindlu                         11
Banjara Layout                 11
2nd Phase Judicial Layout      11
LB Shastri Nagar               11
Name: location, Length: 242, dtype: int64

In [199]:
data['availability'].value_counts()

Ready To Move    10581
18-Dec             307
18-May             295
18-Apr             271
18-Aug             200
                 ...
16-Nov               1
14-Nov               1
16-Jul               1
15-Aug               1
16-Oct               1
Name: availability, Length: 81, dtype: int64

In [200]:
data['availability'] = data['availability'].apply(lambda x:x.strip())
availability_count = data['availability'].value_counts()

In [201]:
availability_count_less_10 = availability_count[availability_count<=10]
availability_count_less_10

22-May    10
17-Aug     9
19-May     9
17-May     8
21-Jul     8
20-Oct     7
17-Apr     7
19-Nov     7
20-Sep     6
21-Sep     6
22-Jan     6
21-Feb     6
21-Oct     6
20-Jul     5
21-Aug     5
17-Mar     5
16-Dec     4
20-Nov     4
20-May     4
20-Apr     4
19-Feb     3
21-Nov     3
22-Mar     3
16-Mar     3
15-Oct     2
16-Sep     2
17-Feb     2
15-Nov     2
22-Nov     2
20-Mar     2
20-Feb     2
17-Jan     1
16-Jan     1
14-Jul     1
15-Jun     1
15-Dec     1
16-Nov     1
14-Nov     1
16-Jul     1
15-Aug     1
16-Oct     1
Name: availability, dtype: int64

In [202]:
data['availability'] = data['availability'].apply(lambda x: 'Ready To Move' if x in availability_count_less_10 else x)

In [203]:
data['availability'].value_counts()

Ready To Move           10743
18-Dec                    307
18-May                    295
18-Apr                    271
18-Aug                    200
19-Dec                    185
18-Jul                    143
18-Mar                    131
18-Jun                     99
20-Dec                     98
21-Dec                     93
19-Mar                     88
18-Feb                     62
18-Nov                     47
18-Jan                     43
18-Sep                     41
19-Jun                     40
18-Oct                     39
19-Jan                     39
19-Jul                     36
17-Dec                     29
20-Jan                     24
19-Sep                     21
17-Oct                     21
22-Jun                     19
19-Aug                     18
21-Jun                     17
19-Apr                     16
20-Aug                     16
Immediate Possession       16
19-Oct                     15
21-Mar                     14
17-Jun                     13
17-Jul                     12
21-Jan                     12
17-Nov                     12
21-May                     12
20-Jun                     11
17-Sep                     11
22-Dec                     11
Name: availability, dtype: int64

In [204]:
data['area_type'].value_counts()

Super built-up  Area    8790
Built-up  Area          2418
Plot  Area              2025
Carpet  Area              87
Name: area_type, dtype: int64

In [125]:
# Outlier Detection And Removal

In [126]:
data.describe()

         total_sqft          bath         price           bhk  price_per_sqft
count  13274.000000  13320.000000  13320.000000  13320.000000    1.327400e+04
mean    1559.626694      2.688814    112.565627      2.802778    7.907501e+03
std     1238.405258      1.338754    148.971674      1.294496    1.064296e+05
min        1.000000      1.000000      8.000000      1.000000    2.678298e+02
25%     1100.000000      2.000000     50.000000      2.000000    4.266865e+03
50%     1276.000000      2.000000     72.000000      3.000000    5.434306e+03
75%     1680.000000      3.000000    120.000000      3.000000    7.311746e+03
max    52272.000000     40.000000   3600.000000     43.000000    1.200000e+07

In [127]:
(data['total_sqft']/data['bhk']).describe()

count    13274.000000
mean       575.074878
std        388.205175
min          0.250000
25%        473.333333
50%        552.500000
75%        625.000000
max      26136.000000
dtype: float64

In [128]:
data = data[((data['total_sqft']/data['bhk']) >=300)]
data.describe()

         total_sqft          bath         price           bhk  price_per_sqft
count  12530.000000  12530.000000  12530.000000  12530.000000    12530.000000
mean    1594.564544      2.559537    111.382401      2.650838     6303.979357
std     1261.271296      1.077938    152.077329      0.976678     4162.237981
min      300.000000      1.000000      8.440000      1.000000      267.829813
25%     1116.000000      2.000000     49.000000      2.000000     4210.526316
50%     1300.000000      2.000000     70.000000      3.000000     5294.117647
75%     1700.000000      3.000000    115.000000      3.000000     6916.666667
max    52272.000000     16.000000   3600.000000     16.000000   176470.588235

In [129]:
data.shape

(12530, 9)

In [130]:
data.price_per_sqft.describe()

count     12530.000000
mean       6303.979357
std        4162.237981
min         267.829813
25%        4210.526316
50%        5294.117647
75%        6916.666667
max      176470.588235
Name: price_per_sqft, dtype: float64

In [131]:
def remove_outliers_sqft(df):
    df_output = pd.DataFrame()
    for key,subdf in df.groupby('location'):
        m = np.mean(subdf.price_per_sqft)
        st = np.std(subdf.price_per_sqft)
        gen_df = subdf[(subdf.price_per_sqft > (m-st)) & (subdf.price_per_sqft <= (m+st))]
        df_output = pd.concat([df_output,gen_df],ignore_index = True)
    return df_output
data = remove_outliers_sqft(data)
data.describe()

         total_sqft          bath         price           bhk  price_per_sqft
count  10301.000000  10301.000000  10301.000000  10301.000000    10301.000000
mean    1508.440608      2.471702     91.286372      2.574896     5659.062876
std      880.694214      0.979449     86.342786      0.897649     2265.774749
min      300.000000      1.000000     10.000000      1.000000     1250.000000
25%     1110.000000      2.000000     49.000000      2.000000     4244.897959
50%     1286.000000      2.000000     67.000000      2.000000     5175.600739
75%     1650.000000      3.000000    100.000000      3.000000     6428.571429
max    30400.000000     16.000000   2200.000000     16.000000    24509.803922

In [132]:
def bhk_outlier_remover(df):
    exclude_indices = np.array([])
    for location,location_df in df.groupby('location'):
        bhk_stats = {}
        for bhk,bhk_df in location_df.groupby('bhk'):
            bhk_stats[bhk] = {
                'mean': np.mean(bhk_df.price_per_sqft),
                'std': np.std(bhk_df.price_per_sqft),
                'count': bhk_df.shape[0]
            }
        for bhk,bhk_df in location_df.groupby('bhk'):
            stats = bhk_stats.get(bhk-1)
            if stats and stats['count']>5:
                exclude_indices = np.append(exclude_indices,bhk_df[bhk_df.price_per_sqft<(stats['mean'])].index.values)
    return df.drop(exclude_indices,axis="index")

In [133]:
data = bhk_outlier_remover(data)

In [134]:
data.shape

(7361, 9)

In [135]:
data

,area_type,availability,location,size,total_sqft,bath,price,bhk,price_per_sqft
0,Super built-up Area,Ready To Move,1st Block Jayanagar,4 BHK,2850.0,4.0,428.0,4,15017.543860
1,Super built-up Area,18-Jun,1st Block Jayanagar,3 BHK,1630.0,3.0,194.0,3,11901.840491
2,Super built-up Area,Ready To Move,1st Block Jayanagar,3 BHK,1875.0,2.0,235.0,3,12533.333333
3,Built-up Area,Ready To Move,1st Block Jayanagar,3 BHK,1200.0,2.0,130.0,3,10833.333333
4,Super built-up Area,18-Jun,1st Block Jayanagar,2 BHK,1235.0,2.0,148.0,2,11983.805668
...,...,...,...,...,...,...,...,...,...
10292,Carpet Area,19-Jan,other,2 BHK,1200.0,2.0,70.0,2,5833.333333
10293,Super built-up Area,Ready To Move,other,1 BHK,1800.0,1.0,200.0,1,11111.111111
10296,Super built-up Area,Ready To Move,other,2 BHK,1353.0,2.0,110.0,2,8130.081301
10297,Plot Area,18-Jan,other,1 Bedroom,812.0,1.0,26.0,1,3201.970443
10300,Super built-up Area,Ready To Move,other,4 BHK,3600.0,5.0,400.0,4,11111.111111

In [136]:
data.drop(columns = ['size','price_per_sqft'],inplace = True)

In [137]:
# Clean Data

In [138]:
data.head()

,area_type,availability,location,total_sqft,bath,price,bhk
0,Super built-up Area,Ready To Move,1st Block Jayanagar,2850.0,4.0,428.0,4
1,Super built-up Area,18-Jun,1st Block Jayanagar,1630.0,3.0,194.0,3
2,Super built-up Area,Ready To Move,1st Block Jayanagar,1875.0,2.0,235.0,3
3,Built-up Area,Ready To Move,1st Block Jayanagar,1200.0,2.0,130.0,3
4,Super built-up Area,18-Jun,1st Block Jayanagar,1235.0,2.0,148.0,2

In [139]:
data.to_csv("Cleaned_data_ver_2.csv")

In [140]:
X = data.drop(columns=['price'])
y = data['price']

In [141]:
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression,Lasso,Ridge
from sklearn.preprocessing import OneHotEncoder, StandardScaler
from sklearn.compose import make_column_transformer
from sklearn.pipeline import make_pipeline
from sklearn.metrics import r2_score

In [142]:
X_train,X_test,y_train,y_test = train_test_split(X,y,test_size=0.2,random_state = 0)

In [143]:
print(X_train.shape)
X_test.shape

(5888, 6)

(1473, 6)

In [144]:
# Applying Linear Regression

In [145]:
column_trans = make_column_transformer((OneHotEncoder(sparse = False),['area_type','location','availability']),remainder = 'passthrough')

In [146]:
scaler = StandardScaler()

In [147]:
lr = LinearRegression(normalize = True)

In [148]:
pipe = make_pipeline(column_trans,scaler,lr)

In [149]:
pipe.fit(X_train,y_train)

Pipeline(steps=[('columntransformer',
                 ColumnTransformer(remainder='passthrough',
                                   transformers=[('onehotencoder',
                                                  OneHotEncoder(sparse=False),
                                                  ['area_type', 'location',
                                                   'availability'])])),
                ('standardscaler', StandardScaler()),
                ('linearregression', LinearRegression(normalize=True))])

In [150]:
y_pred_lr = pipe.predict(X_test)

In [151]:
r2_score(y_test,y_pred_lr)

0.8217924233041345

In [152]:
# Applying Lasso

In [153]:
lasso = Lasso()

In [154]:
pipe = make_pipeline(column_trans,scaler,lasso)

In [155]:
pipe.fit(X_train,y_train)

Pipeline(steps=[('columntransformer',
                 ColumnTransformer(remainder='passthrough',
                                   transformers=[('onehotencoder',
                                                  OneHotEncoder(sparse=False),
                                                  ['area_type', 'location',
                                                   'availability'])])),
                ('standardscaler', StandardScaler()), ('lasso', Lasso())])

In [156]:
y_pred_lasso = pipe.predict(X_test)
r2_score(y_test,y_pred_lasso)

0.8119657029157547

In [157]:
# Applying Ridge

In [158]:
ridge = Ridge()

In [159]:
pipe = make_pipeline(column_trans,scaler,ridge)

In [160]:
pipe.fit(X_train,y_train)

Pipeline(steps=[('columntransformer',
                 ColumnTransformer(remainder='passthrough',
                                   transformers=[('onehotencoder',
                                                  OneHotEncoder(sparse=False),
                                                  ['area_type', 'location',
                                                   'availability'])])),
                ('standardscaler', StandardScaler()), ('ridge', Ridge())])

In [161]:
y_pred_ridge = pipe.predict(X_test)
r2_score(y_test,y_pred_ridge)

0.8218451469855969

In [162]:
print("No Regularization: ",r2_score(y_test,y_pred_lr))
print("Lasso: ",r2_score(y_test,y_pred_lasso))
print("Ridge: ",r2_score(y_test,y_pred_ridge))

No Regularization:  0.8217924233041345
Lasso:  0.8119657029157547
Ridge:  0.8218451469855969

In [163]:
import pickle

In [164]:
pickle.dump(pipe,open('RidgeModel_ver_2.pkl','wb'))